---
kind: type
id: T:Autodesk.Revit.UI.Macros.ApplicationEntryPoint
source: html/7ff0ad2b-7713-ec77-ccc9-8a01fffcf83e.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint

For Revit Macros use only.

## Syntax (C#)
```csharp
public abstract class ApplicationEntryPoint : UIApplication,
	IEntryPoint
```